import numpy as np
import matplotlib.pyplot as plt
from sklearn.cluster import KMeans

data = np.array([
    [23.00890157, 16.9784296], [7.11935759, 0.95665134], [1.51741065, 6.37778502],
    [11.97373724, 8.55346321], [2.23099589, 4.70448874], [13.06445806, 10.1435921],
    [2.14402327, 5.08918986], [12.9508615, 7.95940858], [7.6197604, 1.24413815],
    [2.77331493, 4.48513953], [6.75878155, 0.95890562], [22.94166995, 20.32014439],
    [7.26974898, 0.85299446], [23.33479211, 18.21029955], [6.85018575, 1.52313822],
    [2.37091695, 5.56087095], [2.20420484, 5.21277316], [6.24362095, 1.40599333],
    [7.10170514, 1.0637449], [6.80279522, 1.40958618], [12.85605254, 11.70030624],
    [1.82178156, 5.32557755], [2.47777755, 4.78699576], [12.6258846, 8.57818403],
    [21.38216103, 18.99274573], [1.75619632, 6.01333373], [21.45388644, 18.89939977],
    [12.4160348, 8.82203525], [2.58893397, 5.87908969], [12.80196285, 12.0211404],
    [7.2930382, 0.59980703], [22.32396616, 18.58350518], [12.55049337, 11.49024318],
    [23.35522427, 20.23130153], [13.40618374, 11.86252451], [12.64784792, 10.52122073],
    [7.09546307, 1.00338636], [22.75093528, 17.78730341], [23.09908191, 19.58446818],
    [7.68752282, 1.83595004], [7.75468499, 0.34422751], [12.70894933, 11.60458013],
    [4.15799443, 5.31148959], [2.77466931, 5.39851728], [3.40214056, 5.2628164],
    [2.90208345, 6.9101131], [12.54384157, 11.16703896], [3.54581535, 5.0547978],
    [23.73710487, 19.84858259], [1.14846998, 5.14160704], [25.19488084, 18.37508248],
    [23.22023026, 16.67535356], [13.04921093, 9.91079106], [2.29063004, 4.20809847],
    [23.27972672, 16.44520223], [12.84214634, 10.17781138], [7.1566949, 0.95270014],
    [6.79943724, 0.75233244], [12.83918411, 8.7972511], [7.09105719, 1.07708666],
    [7.2875979, 0.84681862], [21.89022834, 19.62881809], [12.38744272, 10.58479456],
    [22.36752176, 17.77874011], [11.65109794, 11.83907212], [22.96651874, 17.24649853],
    [23.73311794, 19.08861674], [6.91217624, 2.32887425]
])

# 1) Определение количества кластеров методом Elbow

inertia_values = []
for k in range(2, 11):
    kmeans = KMeans(n_clusters=k, random_state=42, n_init=10)
    kmeans.fit(data)
    inertia_values.append(kmeans.inertia_)

plt.plot(range(2, 11), inertia_values, marker='o')
plt.xlabel("Количество кластеров")
plt.ylabel("Сумма квадратов расстояний")
plt.title("Метод локтя")
plt.show()

# 2-3) Кластеризация и печать результатов (Выбираем n_clusters=4)

kmeans = KMeans(n_clusters=4, random_state=42, n_init=10)
kmeans.fit(data)
kmeans.fit(data)
labels = kmeans.labels_
centroids = kmeans.cluster_centers_

print("Метки кластеров:")
print(labels)

print("Координаты центроидов кластеров:")
print(centroids)

labelNum = np.unique(labels)
for v in labelNum:
 print(f"В кластере с меткой {v} содержится {np.sum(labels == v)} точек" )

plt.scatter(data[:,0], data[:,1], c = labels )
plt.scatter(centroids[:,0], centroids[:,1], c = "r")
plt.show()

# 4) Визуализация для 3 различных значений random_state

states = [10, 50, 149]

for rs in states:
    kmeans_rs = KMeans(n_clusters=4, random_state=rs, n_init='auto')
    kmeans_rs.fit(data)

    plt.scatter(data[:, 0], data[:, 1], c=kmeans_rs.labels_)
    plt.scatter(kmeans_rs.cluster_centers_[:, 0], kmeans_rs.cluster_centers_[:, 1], c="r")
    plt.title(f"Кластеризация при random_state = {rs}")
    plt.show()